function SelectSort(arr) {
  let k;
  for (let i = 0; i < arr.length; i++) {
    // k用来记录轮到第几项的索引值,此时i前面的数字是已经排列好的数字,需要和i后面未排列好的数字进行比较
    k = i;
    for (let j = i + 1; j < arr.length; j++) {
      // 每次比较,记录小的数字的索引值
      if (arr[j] < arr[k]) k = j;
    }
    // 每趟比较完后,选出未排列元素中的最小值,依次放在数组前面
    if (k !== i) {
      [arr[k], arr[i]] = [arr[i], arr[k]];
    }
  }
  return arr
}
let a = [0, 1, 1, 1, 4, 5, 3, 7, 7, 8, 10, 2, 7, 8, 0, 5, 2, 16, 12, 1, 19, 15, 5, 18, 2, 2, 22, 15, 8, 22, 17, 6, 22, 6, 22, 26, 32, 8, 10, 11, 2, 26, 9, 12, 9, 7, 28, 33,
  20, 7, 2, 17, 44, 3, 52, 27, 2, 23, 19, 56, 56, 58, 36, 31, 1, 19, 19, 6, 65, 49, 27, 63, 29, 1, 69, 47, 56, 61, 40, 43, 10, 71, 60, 66, 42, 44, 10, 12, 83, 69, 73, 2, 65, 93, 92, 47, 35, 39, 13, 75];
console.log(SelectSort(a));